# Найдите сумму цифр трехзначного числа.

number = input("Введите трехзначное число: ")
res = int(number[0]) + int(number[1]) + int(number[2])
print("Сумма цифр введенного числа равна:", res)
